results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps10000-batch16384-acksall-prod6-complz4-trial1/producer-perf-3.log
producer_index=3
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 7890.0 ms avg latency, 7890.0 ms max latency.
4896 records sent, 979.2 records/sec (0.96 MB/sec), 3379.4 ms avg latency, 4463.0 ms max latency.
16667 records sent, 1047.645987 records/sec (1.02 MB/sec), 4127.60 ms avg latency, 7890.00 ms max latency, 4377 ms 50th, 4585 ms 95th, 4637 ms 99th, 4666 ms 99.9th.